congyaqwq/xiaozhi-esp32/main/boards/movecall-moji-esp32s3-custom/movecall_moji_esp32s3_custom.cc
    #include "wifi_board.h"
    #include "audio_codecs/es8311_audio_codec.h"
    #include "display/lcd_display.h"
    #include "application.h"
    #include "button.h"
    #include "config.h"
    #include "iot/thing_manager.h"
    #include "led/single_led.h"

    #include <wifi_station.h>
    #include <esp_log.h>
    #include <esp_efuse_table.h>
    #include <driver/i2c_master.h>

    #include <esp_lcd_panel_io.h>
    #include <esp_lcd_panel_ops.h>
    #include <esp_lcd_panel_st7789.h>

    #include "driver/gpio.h"
    #include "driver/spi_master.h"

    #define TAG "MovecallMojiESP32S3"

    LV_FONT_DECLARE(font_puhui_20_4);
    LV_FONT_DECLARE(font_awesome_20_4);


    class CustomLcdDisplay : public SpiLcdDisplay {
    public:
        CustomLcdDisplay(esp_lcd_panel_io_handle_t io_handle, 
                        esp_lcd_panel_handle_t panel_handle,
                        int width,
                        int height,
                        int offset_x,
                        int offset_y,
                        bool mirror_x,
                        bool mirror_y,
                        bool swap_xy) 
            : SpiLcdDisplay(io_handle, panel_handle, width, height, offset_x, offset_y, mirror_x, mirror_y, swap_xy,
                        {
                            .text_font = &font_puhui_20_4,
                            .icon_font = &font_awesome_20_4,
                            .emoji_font = font_emoji_64_init(),
                        }) {

            DisplayLockGuard lock(this);
            // 由于屏幕是圆的，所以状态栏需要增加左右内边距
            lv_obj_set_style_pad_left(status_bar_, LV_HOR_RES * 0.33, 0);
            lv_obj_set_style_pad_right(status_bar_, LV_HOR_RES * 0.33, 0);
        }
    };

    class MovecallMojiESP32S3 : public WifiBoard {
    private:
        i2c_master_bus_handle_t codec_i2c_bus_;
        Button boot_button_;
        Display* display_;

        void InitializeCodecI2c() {
            // Initialize I2C peripheral
            i2c_master_bus_config_t i2c_bus_cfg = {
                .i2c_port = I2C_NUM_0,
                .sda_io_num = AUDIO_CODEC_I2C_SDA_PIN,
                .scl_io_num = AUDIO_CODEC_I2C_SCL_PIN,
                .clk_source = I2C_CLK_SRC_DEFAULT,
                .glitch_ignore_cnt = 7,
                .intr_priority = 0,
                .trans_queue_depth = 0,
                .flags = {
                    .enable_internal_pullup = 1,
                },
            };
            ESP_ERROR_CHECK(i2c_new_master_bus(&i2c_bus_cfg, &codec_i2c_bus_));
        }

        // SPI初始化
        void InitializeSpi() {
            ESP_LOGI(TAG, "Initialize SPI bus");
            spi_bus_config_t buscfg = {
                .mosi_io_num = DISPLAY_SPI_MOSI_PIN,
                .miso_io_num = -1,
                .sclk_io_num = DISPLAY_SPI_SCLK_PIN,
                .quadwp_io_num = -1,
                .quadhd_io_num = -1,
                .max_transfer_sz = DISPLAY_WIDTH * DISPLAY_HEIGHT * sizeof(uint16_t),
            #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 0)
                .flags = SPICOMMON_BUSFLAG_MASTER,
            #endif
            };
            ESP_ERROR_CHECK(spi_bus_initialize(SPI3_HOST, &buscfg, SPI_DMA_CH_AUTO));
        }

        // ST7789初始化
        void InitializeSt7789Display() {
            ESP_LOGI(TAG, "Init ST7789 display");

            ESP_LOGI(TAG, "Install panel IO");
            esp_lcd_panel_io_handle_t io_handle = NULL;
            esp_lcd_panel_io_spi_config_t io_config = {
                .cs_gpio_num = DISPLAY_SPI_CS_PIN,
                .dc_gpio_num = DISPLAY_SPI_DC_PIN,
                .spi_mode = 0,
                .pclk_hz = DISPLAY_SPI_SCLK_HZ,
                .trans_queue_depth = 10,
                .on_color_trans_done = NULL,
                .user_ctx = NULL,
                .lcd_cmd_bits = 8,
                .lcd_param_bits = 8,
            };
            ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi(SPI3_HOST, &io_config, &io_handle));
        
            ESP_LOGI(TAG, "Install ST7789 panel driver");
            esp_lcd_panel_handle_t panel_handle = NULL;
            esp_lcd_panel_dev_config_t panel_config = {
                .reset_gpio_num = DISPLAY_SPI_RESET_PIN,
                .rgb_endian = LCD_RGB_ENDIAN_RGB,
                .bits_per_pixel = 16,
                .flags = {
                    .reset_active_high = false,
                }
            };

            ESP_ERROR_CHECK(esp_lcd_new_panel_st7789(io_handle, &panel_config, &panel_handle));
            ESP_ERROR_CHECK(esp_lcd_panel_reset(panel_handle));
            ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));
            ESP_ERROR_CHECK(esp_lcd_panel_invert_color(panel_handle, true));
            ESP_ERROR_CHECK(esp_lcd_panel_mirror(panel_handle, false, false));
            ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(panel_handle, true)); 

            display_ = new SpiLcdDisplay(io_handle, panel_handle,
                                        DISPLAY_WIDTH, DISPLAY_HEIGHT, DISPLAY_OFFSET_X, DISPLAY_OFFSET_Y, DISPLAY_MIRROR_X, DISPLAY_MIRROR_Y, DISPLAY_SWAP_XY,
                                        {
                                            .text_font = &font_puhui_20_4,
                                            .icon_font = &font_awesome_20_4,
                                            .emoji_font = font_emoji_64_init(),
                                        });
        }

        void InitializeButtons() {
            boot_button_.OnClick([this]() {
                auto& app = Application::GetInstance();
                if (app.GetDeviceState() == kDeviceStateStarting && !WifiStation::GetInstance().IsConnected()) {
                    ResetWifiConfiguration();
                }
                app.ToggleChatState();
            });
        }

        // 物联网初始化，添加对 AI 可见设备
        void InitializeIot() {
            auto& thing_manager = iot::ThingManager::GetInstance();
            thing_manager.AddThing(iot::CreateThing("Speaker")); 
            thing_manager.AddThing(iot::CreateThing("Screen"));   
        }

    public:
        MovecallMojiESP32S3() : boot_button_(BOOT_BUTTON_GPIO) {  
            InitializeCodecI2c();
            InitializeSpi();
            InitializeSt7789Display();
            InitializeButtons();
            InitializeIot();
            GetBacklight()->RestoreBrightness();
        }

        virtual Led* GetLed() override {
            static SingleLed led_strip(BUILTIN_LED_GPIO);
            return &led_strip;
        }

        virtual Display* GetDisplay() override {
            return display_;
        }
        
        virtual Backlight* GetBacklight() override {
            static PwmBacklight backlight(DISPLAY_BACKLIGHT_PIN, DISPLAY_BACKLIGHT_OUTPUT_INVERT);
            return &backlight;
        }

        virtual AudioCodec* GetAudioCodec() override {
            static Es8311AudioCodec audio_codec(codec_i2c_bus_, I2C_NUM_0, AUDIO_INPUT_SAMPLE_RATE, AUDIO_OUTPUT_SAMPLE_RATE,
                AUDIO_I2S_GPIO_MCLK, AUDIO_I2S_GPIO_BCLK, AUDIO_I2S_GPIO_WS, AUDIO_I2S_GPIO_DOUT, AUDIO_I2S_GPIO_DIN,
                AUDIO_CODEC_PA_PIN, AUDIO_CODEC_ES8311_ADDR);
            return &audio_codec;
        }
    };

    DECLARE_BOARD(MovecallMojiESP32S3);
